jsphuebner/esp8266-web-interface/src/arm_debug.cpp
    return true;
}

bool ARMDebug::debugHaltOnReset(uint8_t enable)
{
    /* 
    //Enable TRC (Trace and Debug blocks) (including DWT)
    DEMCR &= ~0x01000000; //disable
    DEMCR |= 0x01000000; //enable
    */

	// Vector catch is the mechanism for generating a debug event 
    // and entering Debug state when a particular exception occurs

    uint32_t VC_CORERESET = 0x0;
    if(enable == 1)
        VC_CORERESET = 0x1; //Halt after Reset set VC_CORERESET bit to 1

    if (apWrite(MEM_TAR, REG_SCB_DEMCR))
        if (apWrite(MEM_DRW, VC_CORERESET))
            return true;

    return false;
}

bool ARMDebug::debugReset()
{
    if (apWrite(MEM_TAR, REG_SCB_AIRCR))
        if (apWrite(MEM_DRW, 0xFA050004))
            return true;

    return false;
}

bool ARMDebug::debugStep()
{
    if (apWrite(MEM_TAR, REG_SCB_DHCSR))
        if (apWrite(MEM_DRW, 0xA05F0005))
            return true;
    return false;
}

bool ARMDebug::debugRun()
{
	const uint32_t DHCSR_DEBUG_KEY = 0xA05F0000;

    if (apWrite(MEM_TAR, REG_SCB_DHCSR))
        if (apWrite(MEM_DRW, DHCSR_DEBUG_KEY))
            return true;
    return false;
}

void ARMDebug::flashloaderSRAM()
{
    uint32_t i, size, addr = MEMAP_SRAM_START;

    size = sizeof(flashloader_raw);
    for (i = 0; i < size; i++){
        memStoreByte(addr + i, flashloader_raw[i]);
        memWait();
    }
}

void ARMDebug::flashloaderRUN(uint32_t addr, unsigned count)
{
    uint32_t buf_addr = MEMAP_SRAM_START + sizeof(flashloader_raw); //flashloader end address

    // Update vector table entry in 0xe000ed08 to SRAM start position 0x20000000
    //memStore(REG_SCB_VTOR, MEMAP_SRAM_START); //Debugger to check the core VTOR register

    // https://www.st.com/resource/en/programming_manual/cd00228163-stm32f10xxx-20xxx-21xxx-l1xxxx-cortex-m3-programming-manual-stmicroelectronics.pdf

    // Update R15(PC) with reset vector address. It locates at second word position in firmware.
    /*
    The Program Counter (PC) is register R15. It contains the current program address.
    On reset, the processor loads the PC with the value of the reset vector, which is at address 0x00000004.
    */
    //regWrite(15, flashloader_raw[1] & 0xFFFFFFFE); // R15
    //Serial.printf("Flasloader Program Counter %08x\n", flashloader_raw[1] & 0xFFFFFFFE);

    // Update R13(SP) with stack address defined in first word in firmware.
    /*
    The Stack Pointer (SP) is register R13. In Thread mode, bit[1] of the CONTROL register indicates the stack pointer to use:
    0 = Main Stack Pointer (MSP). This is the reset value.
    1 = Process Stack Pointer (PSP).
    On reset, the processor loads the MSP with the value from address 0x00000000.
    */
    //regWrite(13, flashloader_raw[0]);              // R13
    //Serial.printf("Flasloader Stack Pointer %08x\n", flashloader_raw[0]);

    // Flashloader Variables
    // ----------------------
    // Communication implemented by using fixed-address variables that both parties check (flashloader <-> CPU R0, R1, R2, R3)
    log(LOG_NORMAL,"Flasloader Buffer Start %08x\n", buf_addr);
    log(LOG_NORMAL, "Flasloader Page Count %d\n", count / 2);
    
    //OpenOCD stm32x.h
    regWrite(0, buf_addr);    // Source
    regWrite(1, addr);        // Target
    regWrite(2, count / 2);   // Count(16 bits half words)
    //regWrite(3, 0);         // Result
    /*
    //OpenOCD stm32f1x.h
    uint32_t buf_end = buf_addr + addr; //SRAM workarea without flashloader
    regWrite(0, REG_FPEC_FLASH_ACR); // Flash Base
    regWrite(1, count / 2);   // Count(16 bits half words)
    regWrite(2, buf_addr);    // Workarea start
    regWrite(3, buf_end);     // Workarea end
    regWrite(4, addr);        // Target
    */
    /*
    //ST-Link stm32f0.h
    regWrite(0, buf_addr);    // Source
    regWrite(1, addr);        // Target
    regWrite(2, count / 2);   // Count(16 bits half words)
    if (addr >= REG_FPEC_FLASH_BANK2_START)
        regWrite(3, REG_FPEC_FLASH_BANK2_OFS); // Flash register offset
    else
        regWrite(3, 0);
    */
    regWrite(15, MEMAP_SRAM_START);

    apWrite(0x40003000, 0xAAAA); //Reset IWDG F0
    //apWrite(0x58004800, 0xAAAA); //Reset IWDG H7
    /*
    //Debug
    uint32_t r0, r1, r2, r3, r15;
    regRead(0, r0);
    regRead(1, r1);
    regRead(2, r2);
    regRead(3, r3);
    regRead(15, r15);
    log(LOG_NORMAL, "R0:%08x R1:%08x R2:%08x R3:%08x R15:%08x \n", r0, r1, r2, r3, r15);
    */
    //unlockFlash();

    //Run code
    memStore(REG_SCB_DHCSR, 0xA05F0000);

    flashWait();
}

bool ARMDebug::flashFinalize(uint32_t addr)
{
    uint32_t r13, r15;

    // Set stack
    apRead(addr, r13);
    regWrite(15, r13);
    // Set PC to the reset routine
    apRead(addr + 4, r15);
    regWrite(15, r15);

    debugRun();

    return true;
}

void ARMDebug::writeBufferSRAM(uint32_t addr, const uint8_t *data, unsigned count)
{
    // Write the buffer right after the loader
    uint32_t i, buf_addr = MEMAP_SRAM_START + sizeof(flashloader_raw) + addr; //flashloader end address

    for (i = 0; i < count; i++)
    {
        memStoreByte(buf_addr + i, data[i]);
        memWait();
    }
}

bool ARMDebug::lockFlash()
{
	uint32_t flashlock;
	apRead(REG_FPEC_FLASH_CR, flashlock);

	if (!(flashlock & FLASH_CR_LOCK))
    {
    	if (apWrite(REG_FPEC_FLASH_CR, FLASH_CR_LOCK))
    		return true;
    }
    return false;
}

bool ARMDebug::unlockFlash()
{
    //https://ioprog.com/2018/05/23/using-flash-memory-on-the-stm32f103

    //FLASH_CR default value is 0x80000000. Bit 7 is reset by hardware after detecting unlock sequence. So expected value is 0x00
    /*
    uint32_t flashlock;
	apRead(REG_FPEC_FLASH_CR, flashlock);
    log(LOG_NORMAL, "Flash Unlock Check %08x\n",flashlock);
    */

	//if (flashlock & FLASH_CR_LOCK) {
    	/*
	    An unlocking sequence should be written to the FLASH_KEYR register to open up the FPEC block.
	    This sequence consists of two write cycles, where two key values (KEY1 and KEY2) are written to the FLASH_KEYR address
	    */
        memStore(REG_FPEC_FLASH_KEYR, REG_FPEC_KEY_KEY1);
        memStore(REG_FPEC_FLASH_KEYR, REG_FPEC_KEY_KEY2);
        flashWait();
	    //Authorize the programming of the option bytes by writing the same set of KEYS (KEY1 and KEY2) to the FLASH_OPTKEYR register
	    //memStore(REG_FPEC_FLASH_OPTKEYR, REG_FPEC_KEY_KEY1);
	    //memStore(REG_FPEC_FLASH_OPTKEYR, REG_FPEC_KEY_KEY2);
        //flashWait();
    //}
    //Any wrong sequence locks up the FPEC block and FLASH_CR register until the next reset.

